# SplitElementId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceSplitter..::..SplitElementId Property
FaceSplitter Class See Also
---
The id of the element whose face is split by this element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId SplitElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SplitElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SplitElementId {
	ElementId^ get ();
}
```

# See Also
FaceSplitter Class
Autodesk.Revit.DB Namespace